Output from Terraform plan
```[command]/home/runner/work/_temp/76c50f58-b488-4b71-995f-9152a047bc94/terraform-bin plan -refresh=false -no-color -out=plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_dns_cname_record.preprod will be created
  + resource "azurerm_dns_cname_record" "preprod" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "preprod"
      + record              = "iis-preprod.azurewebsites.net"
      + resource_group_name = "iis-prod"
      + ttl                 = 300
      + zone_name           = "hpa.service.justice.gov.uk"
    }

  # azurerm_dns_cname_record.prod will be created
  + resource "azurerm_dns_cname_record" "prod" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prod"
      + record              = "iis-prod.azurewebsites.net"
      + resource_group_name = "iis-prod"
      + ttl                 = 300
      + zone_name           = "hpa.service.justice.gov.uk"
    }

  # azurerm_dns_cname_record.stage will be created
  + resource "azurerm_dns_cname_record" "stage" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "stage"
      + record              = "iis-stage.azurewebsites.net"
      + resource_group_name = "iis-prod"
      + ttl                 = 300
      + zone_name           = "hpa.service.justice.gov.uk"
    }

  # azurerm_dns_zone.hpa_service_justice_gov_uk will be created
  + resource "azurerm_dns_zone" "hpa_service_justice_gov_uk" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "hpa.service.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "iis-prod"
      + tags                      = {
          + "application"      = "HPA"
          + "business_unit"    = "HMPPS"
          + "environment_name" = "prod"
          + "is_production"    = "true"
          + "owner"            = "Malcolm Casimir:malcolm.casimir@digital.justice.gov.uk"
          + "service"          = "Misc"
          + "source_code"      = "infra=https://github.com/ministryofjustice/digital-studio-infra/tree/main/iis/prod"
        }

      + soa_record {
          + email         = "azuredns-hostmaster.microsoft.com"
          + expire_time   = 2419200
          + fqdn          = (known after apply)
          + host_name     = "ns1-09.azure-dns.com."
          + minimum_ttl   = 300
          + refresh_time  = 3600
          + retry_time    = 300
          + serial_number = 1
          + ttl           = 3600
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_dns_cname_record.preprod will be created%0A  + resource "azurerm_dns_cname_record" "preprod" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "preprod"%0A      + record              = "iis-preprod.azurewebsites.net"%0A      + resource_group_name = "iis-prod"%0A      + ttl                 = 300%0A      + zone_name           = "hpa.service.justice.gov.uk"%0A    }%0A%0A  # azurerm_dns_cname_record.prod will be created%0A  + resource "azurerm_dns_cname_record" "prod" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "prod"%0A      + record              = "iis-prod.azurewebsites.net"%0A      + resource_group_name = "iis-prod"%0A      + ttl                 = 300%0A      + zone_name           = "hpa.service.justice.gov.uk"%0A    }%0A%0A  # azurerm_dns_cname_record.stage will be created%0A  + resource "azurerm_dns_cname_record" "stage" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "stage"%0A      + record              = "iis-stage.azurewebsites.net"%0A      + resource_group_name = "iis-prod"%0A      + ttl                 = 300%0A      + zone_name           = "hpa.service.justice.gov.uk"%0A    }%0A%0A  # azurerm_dns_zone.hpa_service_justice_gov_uk will be created%0A  + resource "azurerm_dns_zone" "hpa_service_justice_gov_uk" {%0A      + id                        = (known after apply)%0A      + max_number_of_record_sets = (known after apply)%0A      + name                      = "hpa.service.justice.gov.uk"%0A      + name_servers              = (known after apply)%0A      + number_of_record_sets     = (known after apply)%0A      + resource_group_name       = "iis-prod"%0A      + tags                      = {%0A          + "application"      = "HPA"%0A          + "business_unit"    = "HMPPS"%0A          + "environment_name" = "prod"%0A          + "is_production"    = "true"%0A          + "owner"            = "Malcolm Casimir:malcolm.casimir@digital.justice.gov.uk"%0A          + "service"          = "Misc"%0A          + "source_code"      = "infra=https://github.com/ministryofjustice/digital-studio-infra/tree/main/iis/prod"%0A        }%0A%0A      + soa_record {%0A          + email         = "azuredns-hostmaster.microsoft.com"%0A          + expire_time   = 2419200%0A          + fqdn          = (known after apply)%0A          + host_name     = "ns1-09.azure-dns.com."%0A          + minimum_ttl   = 300%0A          + refresh_time  = 3600%0A          + retry_time    = 300%0A          + serial_number = 1%0A          + ttl           = 3600%0A        }%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_dns_cname_record.preprod will be created%0A  + resource "azurerm_dns_cname_record" "preprod" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "preprod"%0A      + record              = "iis-preprod.azurewebsites.net"%0A      + resource_group_name = "iis-prod"%0A      + ttl                 = 300%0A      + zone_name           = "hpa.service.justice.gov.uk"%0A    }%0A%0A  # azurerm_dns_cname_record.prod will be created%0A  + resource "azurerm_dns_cname_record" "prod" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "prod"%0A      + record              = "iis-prod.azurewebsites.net"%0A      + resource_group_name = "iis-prod"%0A      + ttl                 = 300%0A      + zone_name           = "hpa.service.justice.gov.uk"%0A    }%0A%0A  # azurerm_dns_cname_record.stage will be created%0A  + resource "azurerm_dns_cname_record" "stage" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "stage"%0A      + record              = "iis-stage.azurewebsites.net"%0A      + resource_group_name = "iis-prod"%0A      + ttl                 = 300%0A      + zone_name           = "hpa.service.justice.gov.uk"%0A    }%0A%0A  # azurerm_dns_zone.hpa_service_justice_gov_uk will be created%0A  + resource "azurerm_dns_zone" "hpa_service_justice_gov_uk" {%0A      + id                        = (known after apply)%0A      + max_number_of_record_sets = (known after apply)%0A      + name                      = "hpa.service.justice.gov.uk"%0A      + name_servers              = (known after apply)%0A      + number_of_record_sets     = (known after apply)%0A      + resource_group_name       = "iis-prod"%0A      + tags                      = {%0A          + "application"      = "HPA"%0A          + "business_unit"    = "HMPPS"%0A          + "environment_name" = "prod"%0A          + "is_production"    = "true"%0A          + "owner"            = "Malcolm Casimir:malcolm.casimir@digital.justice.gov.uk"%0A          + "service"          = "Misc"%0A          + "source_code"      = "infra=https://github.com/ministryofjustice/digital-studio-infra/tree/main/iis/prod"%0A        }%0A%0A      + soa_record {%0A          + email         = "azuredns-hostmaster.microsoft.com"%0A          + expire_time   = 2419200%0A          + fqdn          = (known after apply)%0A          + host_name     = "ns1-09.azure-dns.com."%0A          + minimum_ttl   = 300%0A          + refresh_time  = 3600%0A          + retry_time    = 300%0A          + serial_number = 1%0A          + ttl           = 3600%0A        }%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0A
::set-output name=stderr::
::set-output name=exitcode::0
```